dzavalishin/eref/_modules/arm/cristmas_tree/lpc21isp_137x.c
        DebugPrintf(2, "Sector %ld: ", Sector);
        fflush(stdout);

		if(IspEnvironment->BinaryOffset < LPC_RAMSTART) // Skip Erase when running from RAM
		{
        	sprintf(tmpString, "P %ld %ld\r\n", Sector, Sector);
        	if (!SendAndVerify(IspEnvironment, tmpString, Answer, sizeof Answer))
        	{
        	    DebugPrintf( 1, "Wrong answer on Prepare-Command (1) (Sector %ld)\n", Sector);
        	    PhilipsOutputErrorMessage(GetErrorNumber(Answer));
        	    return( WRONG_ANSWER_PREP + GetErrorNumber(Answer) );
        	}

        	DebugPrintf( 2, ".");
        	fflush(stdout);

        	sprintf(tmpString, "E %ld %ld\r\n", Sector, Sector);
        	if (!SendAndVerify(IspEnvironment, tmpString, Answer, sizeof Answer))
        	{
        	    DebugPrintf( 1, "Wrong answer on Erase-Command (Sector %ld)\n", Sector);
        	    PhilipsOutputErrorMessage(GetErrorNumber(Answer));
        	    return( WRONG_ANSWER_ERAS + GetErrorNumber(Answer) );
        	}

        	DebugPrintf( 2, ".");
        	fflush(stdout);
		}

       	SectorLength = LPCtypes[IspEnvironment->DetectedDevice].SectorTable[Sector];
       	if(SectorLength > IspEnvironment->BinaryLength - SectorStart)
       	{
       	    SectorLength = IspEnvironment->BinaryLength - SectorStart;
       	}

        for(SectorOffset = 0; SectorOffset < SectorLength; SectorOffset += SectorChunk)
        {
			if (SectorOffset > 0)
			{
				// Add a visible marker between segments in a sector
                DebugPrintf(2, "|");  /* means: partial segment copied */
                fflush(stdout);
			}

                // If the Flash ROM sector size is bigger than the number of bytes
                // we can copy from RAM to Flash, we must "chop up" the sector and
                // copy these individually.
                // This is especially needed in the case where a Flash sector is
                // bigger than the amount of SRAM.
            SectorChunk = SectorLength - SectorOffset;
            if(SectorChunk > (unsigned)LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize)
            {
                SectorChunk = LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize;
            }

                // Write multiple of 45 * 4 Byte blocks to RAM, but copy maximum of on sector to Flash
                // In worst case we transfer up to 180 byte to much to RAM
                // but then we can always use full 45 byte blocks and length is multiple of 4
            CopyLength = SectorChunk;
            if((CopyLength % (45 * 4)) != 0)
            {
                CopyLength += ((45 * 4) - (CopyLength % (45 * 4)));
            }
          	sprintf(tmpString, "W %ld %ld\r\n", LPC_RAMBASE, CopyLength);

            if (!SendAndVerify(IspEnvironment, tmpString, Answer, sizeof Answer))
            {
                DebugPrintf( 1, "Wrong answer on Write-Command\n");
                PhilipsOutputErrorMessage(GetErrorNumber(Answer));
                return( WRONG_ANSWER_WRIT + GetErrorNumber(Answer) );
            }

            DebugPrintf( 2, ".");
            fflush(stdout);

            block_CRC = 0;
            Line = 0;

                // Transfer blocks of 45 * 4 bytes to RAM
            for(Pos = SectorStart + SectorOffset; (Pos < SectorStart + SectorOffset + CopyLength) && (Pos < IspEnvironment->BinaryLength); Pos += (45 * 4))
            {
                for(Block = 0; Block < 4; Block++)  // Each block 45 bytes
                {
                    DebugPrintf( 2, ".");
                    fflush(stdout);

                        // Uuencode one 45 byte block
                    tmpStringPos = 0;

                    tmpString[tmpStringPos++] = (char)(' ' + 45);  // Encode Length of block

                    for(BlockOffset = 0; BlockOffset < 45; BlockOffset++)
                    {
						if(IspEnvironment->BinaryOffset < LPC_RAMSTART)
						{ // Flash: use full memory
                        	c = IspEnvironment->BinaryContent[Pos + Block * 45 + BlockOffset];
						}
						else
						{ // RAM: Skip first 0x200 bytes, these are used by the download program in LPC21xx
							c = IspEnvironment->BinaryContent[Pos + Block * 45 + BlockOffset + 0x200];
						}

                        block_CRC += c;

                        k = (k << 8) + (c & 255);

                        if((BlockOffset % 3) == 2)   // Collecting always 3 Bytes, then do processing in 4 Bytes
                        {
                            tmpString[tmpStringPos++] = uuencode_table[(k >> 18) & 63];
                            tmpString[tmpStringPos++] = uuencode_table[(k >> 12) & 63];
                            tmpString[tmpStringPos++] = uuencode_table[(k >>  6) & 63];
                            tmpString[tmpStringPos++] = uuencode_table[ k        & 63];
                        }
                    }

                    tmpString[tmpStringPos++] = '\r';
                    tmpString[tmpStringPos++] = '\n';
                    tmpString[tmpStringPos++] = 0;

                    SendComPort( IspEnvironment, tmpString);

                    ReceiveComPort( IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 1,5000);
#if 0
                    if(strncmp(Answer, tmpString, tmpStringPos) != 0)
                    {
                        DebugPrintf( 1, "Error on writing data (1)\n");
DebugPrintf( 1, "Read size    = %d, \n", realsize);
DebugPrintf( 1, "tmpStringPos = %d, \n", tmpStringPos);
DebugPrintf( 1, "Answer = '%s'\n", Answer);
DebugPrintf( 1, "Temp   = '%s'\n", tmpString);
{
  int i;
for(i=0; i<realsize;i++)
{
  if (Answer[i] != tmpString[i])
    printf("\nError at [%d], Answer = %x, expected = %x", i, Answer[i], tmpString[i]);
}
if (realsize < tmpStringPos)
{
  for(i=realsize; i<tmpStringPos; i++)
    printf("\nMissing at [%d] expected = %x", i, tmpString[i]);
}
}
                        return( ERROR_WRITE_DATA );
                    }
#endif
                    Line++;

                    DebugPrintf( 3, "Line = %d\n", Line);

                    if(Line == 20)
                    {
                            // printf("block_CRC = %ld\n", block_CRC);

                        sprintf(tmpString, "%ld\r\n", block_CRC);
                        SendComPort( IspEnvironment, tmpString);

                        ReceiveComPort( IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 2,5000);

