dzavalishin/eref/_modules/arm/cristmas_tree/lpc21isp_137x.c
                        sprintf(tmpString, "%ld\r\nOK\r\n", block_CRC);
                        if(strcmp(Answer, tmpString) != 0)
                        {
                            DebugPrintf( 1, "Error on writing block_CRC (1)\n");
                            return( ERROR_WRITE_CRC );
                        }

                        Line = 0;
                        block_CRC = 0;
                    }
                }
            }

            if(Line != 0)
            {
                sprintf(tmpString, "%ld\r\n", block_CRC);
                SendComPort( IspEnvironment, tmpString);

                ReceiveComPort( IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 2,5000);

                sprintf(tmpString, "%ld\r\nOK\r\n", block_CRC);
                if(strcmp(Answer, tmpString) != 0)
                {
                    DebugPrintf( 1, "Error on writing block_CRC (2)\n");
                    return( ERROR_WRITE_CRC2 );
                }
            }

			if(IspEnvironment->BinaryOffset < LPC_RAMSTART)
			{
            	    // Prepare command must be repeated before every write
            	sprintf(tmpString, "P %ld %ld\r\n", Sector, Sector);
            	if (!SendAndVerify(IspEnvironment, tmpString, Answer, sizeof Answer))
            	{
            	    DebugPrintf( 1, "Wrong answer on Prepare-Command (2) (Sector %ld)\n", Sector);
            	    PhilipsOutputErrorMessage(GetErrorNumber(Answer));
            	    return( WRONG_ANSWER_PREP2 + GetErrorNumber(Answer) );
            	}

            	   // Round CopyLength up to one of the following values: 512, 1024,
            	   // 4096, 8192; but do not exceed the maximum copy size (usually
            	   // 8192, but chip-dependent)
            	if(CopyLength < 512)
            	{
            	    CopyLength = 512;
            	}
            	else if(SectorLength < 1024)
            	{
            	    CopyLength = 1024;
            	}
            	else if(SectorLength < 4096)
            	{
            	    CopyLength = 4096;
            	}
            	else
            	{
            	    CopyLength = 8192;
            	}
            	if(CopyLength > (unsigned)LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize)
            	{
            	    CopyLength = LPCtypes[IspEnvironment->DetectedDevice].MaxCopySize;
            	}

            	sprintf(tmpString, "C %ld %ld %ld\r\n", SectorStart + SectorOffset, LPC_RAMBASE, CopyLength);
            	if (!SendAndVerify(IspEnvironment, tmpString, Answer, sizeof Answer))
            	{
            	    DebugPrintf( 1, "Wrong answer on Copy-Command\n");
            	    PhilipsOutputErrorMessage(GetErrorNumber(Answer));
            	    return( WRONG_ANSWER_COPY + GetErrorNumber(Answer) );
            	}
			}

        }

        DebugPrintf(2, "\n");
        fflush(stdout);

        if((SectorStart + SectorLength) >= IspEnvironment->BinaryLength && Sector!=0)
        {
            Sector = 0;
            SectorStart = 0;
        }
        else if( Sector == 0 ) {
            break;
        }
        else {
            SectorStart += LPCtypes[IspEnvironment->DetectedDevice].SectorTable[Sector];
            Sector++;
        }
    }

    tDoneUpload = time(NULL);
    DebugPrintf( 2, "Download Finished... taking %d seconds\n", tDoneUpload - tStartUpload);

    if (WaitForWatchDog)
    {
        DebugPrintf( 2, "Wait for restart, in %d seconds from now\n", WatchDogSeconds - (tDoneUpload - tStartUpload));
    }
    else
    {
        DebugPrintf( 2, "Now launching the brand new code\n" );
        fflush(stdout);

		sprintf(tmpString, "G %ld A\r\n", IspEnvironment->StartAddress);
        SendComPort(IspEnvironment, tmpString); //goto 0 : run this fresh new downloaded code code
        if(IspEnvironment->BinaryOffset < LPC_RAMSTART)
        { // Skip response on G command - show response on Terminal instead
        	ReceiveComPort(IspEnvironment, Answer, sizeof(Answer)-1, &realsize, 2, 5000);
        	/* the reply string is frequently terminated with a -1 (EOF) because the
        	 * connection gets broken; zero-terminate the string ourselves
        	 */
        	while (realsize > 0 && Answer[(int)realsize - 1] < 0)
        	    realsize--;
        	Answer[(int)realsize] = '\0';
        	/* Better to check only the first 9 chars instead of complete receive buffer,
        	 * because the answer can contain the output by the started programm
        	 */
        	if(realsize == 0 || strncmp((const char *)Answer, "G 0 A\r\n0\r", 9) != 0)
        	{
        	    DebugPrintf( 2, "Failed to run the new downloaded code: ");
        	    PhilipsOutputErrorMessage(GetErrorNumber(Answer));
        	    return( FAILED_RUN + GetErrorNumber(Answer) );
        	}
		}
        fflush(stdout);
    }
    return(0);
}


#if !defined COMPILE_FOR_LPC21
/***************************** Terminal *********************************/
/**  Acts as a simple dumb terminal. Press 'ESC' to exit.
*/
static void Terminal( ISP_ENVIRONMENT *IspEnvironment)
{
    int           ch = 0;
    char buffer[128];
    int           fdlogfile = -1;
    unsigned long realsize;

        // When logging is switched on, output terminal output to lpc21isp.log
    if(IspEnvironment->LogFile)
    {
        fdlogfile = open("lpc21isp.log", O_RDWR | O_BINARY | O_CREAT | O_TRUNC, 0777);
    }

    DebugPrintf( 1, "Terminal started (press Escape to abort)\n\n");
    fflush(stdout);

    do
    {
            // Check for received characters

        ReceiveComPort( IspEnvironment, buffer, sizeof(buffer) - 1, &realsize, 0,200);

        if( realsize )
        {
            write(1, buffer, realsize);
            fflush(stdout);
            if(IspEnvironment->LogFile)     // When logging is turned on, then copy output to logfile
            {
                write(fdlogfile, buffer, realsize);
            }
        }

            // check for keypress, and write any out the port.
        if ( kbhit() )
        {
            ch = getch();
            if(ch == 0x1b)
            {
                break;
            }

